class Upgrade {
    constructor(name, cost, points, cycleTime, description) {
        this.name = name; // Название улучшения
        this.cost = cost; // Стоимость улучшения
        this.points = points; // Количество очков, которые даёт улучшение
        this.cycleTime = cycleTime; // Время цикла в секундах
        this.description = description; // Описание улучшения
    }
}

// Пример создания улучшений
const корм = new Upgrade(
    "Корм",
    10, // Стоимость улучшения
    1, // Очков, которые даёт улучшение
    10, // Цикл времени (в секундах)
    "Привлекает кошачье население каждые 10 секунд."
);

const бабушка = new Upgrade(
    "Бабушка",
    250, // Стоимость улучшения
    50, // Очков, которые даёт улучшение
    20, // Цикл времени (в секундах)
    "Заселяет к себе кошачье население, производит очки каждые 20 секунд."
);

const фабрикаКотиков = new Upgrade(
    "Фабрика котиков",
    500, // Стоимость улучшения
    100, // Очков, которые даёт улучшение
    30, // Цикл времени (в секундах)
    "Повышение рождаемости котят, производит очки каждые 30 секунд."
);

// Пример вывода информации об улучшениях
console.log(корм);
console.log(фабрикаКотиков);
console.log(бабушка);
